// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите число от 1 до 7: ");
int N = int.Parse(Console.ReadLine()!);
if(N > 7 || N < 1) 
    {
        Console.WriteLine("Вы ввели неверное число");
    }
    if( N > 0 && N <= 5)
        {
            Console.WriteLine("Выбранный Вами день недели не является выходным днем");
        }
    else 
        {
            Console.WriteLine("Выбранный Вами день недели - выходной");
        }